public class HangManStages {
    public final static String[] HANG_MAN_STAGES = {
            // Пустая виселица
            """
            +---+
            |   |
                |
                |
                |
                |
            ========
        """,
            // Голова
            """
            +---+
            |   |
            O   |
                |
                |
                |
            ========
        """,
            // Голова и туловище
            """
            +---+
            |   |
            O   |
            |   |
                |
                |
            ========
        """,
            // Голова, туловище и одна рука
            """
            +---+
            |   |
            O   |
           /|   |
                |
                |
            ========
        """,
            // Голова, туловище и две руки
            """
            +---+
            |   |
            O   |
           /|\\  |
                |
                |
            ========
        """,
            // Голова, туловище, две руки и одна нога
            """
            +---+
            |   |
            O   |
           /|\\  |
           /    |
                |
            ========
        """,
            // Полностью нарисованная фигура
            """
            +---+
            |   |
            O   |
           /|\\  |
           / \\  |
                |
            ========
        """
    };
    public static void render_hangman_stages(int counterOfMisses){
        System.out.println(HANG_MAN_STAGES[counterOfMisses]);
    }
}
